Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СерииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B1_ОсновнаяСерияВБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветМеталла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветаМеталла</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталлаГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбщийВесВставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталлаВЧистоте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбщийВесВставокГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталлаВЧистотеГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесоваяГруппаГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВесовыхГруппГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтепеньВнутреннегоОтраженияГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтепенейВнутреннегоОтраженияГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаличиеСколовДефектовГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНаличияСколовДефектовГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаОгранкиГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторГруппОгранкиГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяКлассификацияГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьФизическаяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НельзяНанестиФизическуюМаркировку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидПартийГИИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПартийГИИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УИН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/B1_СохранениеФайлов/Ext/Module.bsl
Процедура B1_СохранитьБаркодыВExcelФайл(ИмяФайла, ТипФайла, ОбъектСсылка) Экспорт
	
	НовыйТабличныйДокумент = Новый ТабличныйДокумент;                  
	ШапкаТаблицы = Новый Массив;
	ШапкаТаблицы.Добавить("Артикул WB");
	ШапкаТаблицы.Добавить("Баркод");
	ШапкаТаблицы.Добавить("Размер");
	ШапкаТаблицы.Добавить("! Баркода для одного артикула продавца необходимо указать в одной строке и через разделитель ;");
	
	СчетчикКолонок = 1;
	ПерваяСтрока = 1;
	ШрифтШапки = Новый Шрифт(,, Истина);
	Для каждого ЭлементШапки Из ШапкаТаблицы Цикл
		ОбластьШапки = НовыйТабличныйДокумент.Область(ПерваяСтрока, СчетчикКолонок);
		ОбластьШапки.Текст = ЭлементШапки;
		ОбластьШапки.Шрифт = ШрифтШапки;
		ОбластьШапки.ШиринаКолонки = 15;
		
	    СчетчикКолонок = СчетчикКолонок + 1;
	КонецЦикла;
		
	СтрокаФайла = ПерваяСтрока + 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументТовары.Номенклатура КАК Номенклатура,
		|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДокументТовары.Размер КАК Размер,
		|	ДокументТовары.СерияНоменклатуры.Наименование КАК СерияНоменклатурыНаименование
		|ИЗ
		|	Документ.%ИмяДокумента%.Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры,
		|	Размер,
		|	СерияНоменклатурыНаименование
		|ИТОГИ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры,
		|	Размер";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяДокумента%", ОбъектСсылка.Метаданные().Имя);
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
	
		ВыборкаХарактеристикаНоменклатуры = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаХарактеристикаНоменклатуры.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаХарактеристикаНоменклатуры.ХарактеристикаНоменклатуры) Тогда
				//АртикулДляВБ = ВыборкаХарактеристикаНоменклатуры.Номенклатура.Артикул + ВыборкаХарактеристикаНоменклатуры.ХарактеристикаНоменклатуры.B1_ДопАртикулДляВБ;
				АртикулДляВБ = ВыборкаХарактеристикаНоменклатуры.ХарактеристикаНоменклатуры.B1_АртикулВБ;
			Иначе
				//АртикулДляВБ = ВыборкаХарактеристикаНоменклатуры.Номенклатура.Артикул + ВыборкаХарактеристикаНоменклатуры.Номенклатура.B1_ДопАртикулДляВБПоУмолчанию;	
				АртикулДляВБ = ВыборкаХарактеристикаНоменклатуры.Номенклатура.B1_АртикулВБ;	
			КонецЕсли; 
			
			ВыборкаРазмер = ВыборкаХарактеристикаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаРазмер.Следующий() Цикл
								
				РазмерВБ = ?(ЗначениеЗаполнено(ВыборкаРазмер.Размер), ВыборкаРазмер.Размер, "0");
				
				МассивШтрихкодов = Новый Массив;
				ОсновнойШтрихкодВБ = "";
				//ОсновнойШтрихкодВБ = ПолучитьОсновнойШтрихкодВБ(ВыборкаРазмер);
				//МассивШтрихкодов.Добавить(ОсновнойШтрихкодВБ);
				
				ВыборкаДетальныеЗаписи = ВыборкаРазмер.Выбрать();
	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ВыборкаДетальныеЗаписи.СерияНоменклатурыНаименование <> ОсновнойШтрихкодВБ Тогда
						МассивШтрихкодов.Добавить(ВыборкаДетальныеЗаписи.СерияНоменклатурыНаименование);
					КонецЕсли; 
				КонецЦикла;
				
				СвернутыйМассив = Новый Массив;

				Для Каждого Штрихкод Из МассивШтрихкодов Цикл
					Если СвернутыйМассив.Найти(Штрихкод) = Неопределено Тогда
						СвернутыйМассив.Добавить(Штрихкод);
					КонецЕсли;
				КонецЦикла;
				
				НовыйТабличныйДокумент.Область(СтрокаФайла, 1).Текст = Формат(АртикулДляВБ, "ЧГ=0");
				НовыйТабличныйДокумент.Область(СтрокаФайла, 2).Текст = СтрСоединить(СвернутыйМассив, ";");
				НовыйТабличныйДокумент.Область(СтрокаФайла, 3).Текст = СтрЗаменить(РазмерВБ, ".", ",");
				
				СтрокаФайла = СтрокаФайла + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ШрифтДокумента = Новый Шрифт(,10);
	НовыйТабличныйДокумент.Область(1, 1, СтрокаФайла, СчетчикКолонок).Шрифт = ШрифтДокумента;
	НовыйТабличныйДокумент.Записать(ИмяФайла, ТипФайла);
		
КонецПроцедуры

Функция ПолучитьОсновнойШтрихкодВБ(СтрокаВыборки) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СерииНоменклатуры.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Владелец = &Владелец
		|	И СерииНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|	И СерииНоменклатуры.Размер = &Размер
		|
		|УПОРЯДОЧИТЬ ПО
		|	СерииНоменклатуры.Код УБЫВ";
	
	Запрос.УстановитьПараметр("Владелец", СтрокаВыборки.Номенклатура);
	Запрос.УстановитьПараметр("Размер", СтрокаВыборки.Размер);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СтрокаВыборки.ХарактеристикаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВозвращаемоеЗначение = ВыборкаДетальныеЗаписи.Наименование;	
	Иначе	
		ВозвращаемоеЗначение = "";	
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
